In [6]:
import pandas as pd

In [7]:
groceries=pd.Series(data=[30,40,50,60,70], index=['apple','banana','mango','kiwi','orange'])
print(groceries, type(groceries), groceries.shape, groceries.size)

apple     30
banana    40
mango     50
kiwi      60
orange    70
dtype: int64 <class 'pandas.core.series.Series'> (5,) 5

In [8]:
a='apple' in groceries
b= 'strawberry' in groceries
print(a,b)

True False

In [9]:
print(groceries.index)
print(groceries.values)

Index(['apple', 'banana', 'mango', 'kiwi', 'orange'], dtype='object')
[30 40 50 60 70]

In [10]:
groceries[['banana','mango']]

banana    40
mango     50
dtype: int64

In [11]:
groceries['eggs']=6
print(groceries)

apple     30
banana    40
mango     50
kiwi      60
orange    70
eggs       6
dtype: int64

In [12]:
groceries.loc[['banana','eggs']]

banana    40
eggs       6
dtype: int64

In [13]:
groceries.drop('eggs')

apple     30
banana    40
mango     50
kiwi      60
orange    70
dtype: int64

In [14]:
print(groceries)

apple     30
banana    40
mango     50
kiwi      60
orange    70
eggs       6
dtype: int64

In [15]:
groceries.drop('eggs', inplace=True)

In [16]:
print(groceries)

apple     30
banana    40
mango     50
kiwi      60
orange    70
dtype: int64

### Arithmetic Operations

In [18]:
groceries+2 #add two to each element of groceries

apple     32
banana    42
mango     52
kiwi      62
orange    72
dtype: int64

In [19]:
groceries-2 #subtract 2 from each element of groceries

apple     28
banana    38
mango     48
kiwi      58
orange    68
dtype: int64

In [20]:
groceries*2 #multiply by 2 each element of groceries

apple      60
banana     80
mango     100
kiwi      120
orange    140
dtype: int64

In [21]:
groceries/2 #divide by 2 from each element of groceries

apple     15.0
banana    20.0
mango     25.0
kiwi      30.0
orange    35.0
dtype: float64

In [22]:
import numpy as np

In [23]:
np.mean(groceries)

50.0

In [24]:
np.sqrt(groceries)

apple     5.477226
banana    6.324555
mango     7.071068
kiwi      7.745967
orange    8.366600
dtype: float64

In [25]:
np.max(groceries)

70

In [26]:
np.min(groceries)

30

In [27]:
np.exp(groceries)

apple     1.068647e+13
banana    2.353853e+17
mango     5.184706e+21
kiwi      1.142007e+26
orange    2.515439e+30
dtype: float64

In [28]:
np.power(groceries,2)

apple      900
banana    1600
mango     2500
kiwi      3600
orange    4900
dtype: int64

In [29]:
np.power(groceries[['banana', 'mango']],2)

banana    1600
mango     2500
dtype: int64

In [30]:
groceries['apple']+2

32

In [31]:
np.mean(groceries.loc[['kiwi','orange']])

65.0

In [32]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}
print(type(items))

<class 'dict'>

In [33]:
cart=pd.DataFrame(items)

In [34]:
print(cart)
print(type(cart))
type(cart['Bob'])

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN
<class 'pandas.core.frame.DataFrame'>

pandas.core.series.Series

In [35]:
bob_cart=pd.DataFrame(cart['Bob'])
print(bob_cart)

           Bob
bike     245.0
book       NaN
glasses    NaN
pants     25.0
watch     55.0

In [36]:
sel_cart=pd.DataFrame(cart, index=['bike','book'])
print(sel_cart)

        Bob  Alice
bike  245.0  500.0
book    NaN   40.0

In [37]:
sel_cart=pd.DataFrame(cart, index=['bike','book'], columns=['Alice'])
print(sel_cart)

      Alice
bike  500.0
book   40.0

In [38]:
data={'Integers':[1,2,3], 'Floats':[1.2,3.4,5.6]}
df=pd.DataFrame(data)
print(df)

   Integers  Floats
0         1     1.2
1         2     3.4
2         3     5.6

In [39]:
df=pd.DataFrame(data, index=[1,2,3])
print(df)

   Integers  Floats
1         1     1.2
2         2     3.4
3         3     5.6

In [40]:
cart.loc[['bike','book']]

        Bob  Alice
bike  245.0  500.0
book    NaN   40.0

In [41]:
cart['Bob']['bike']

245.0

In [42]:
cart['Mary']= pd.Series([200,50,600], index=['bike','book','watch'])

In [43]:
print(cart)

           Bob  Alice   Mary
bike     245.0  500.0  200.0
book       NaN   40.0   50.0
glasses    NaN  110.0    NaN
pants     25.0   45.0    NaN
watch     55.0    NaN  600.0

In [44]:
df['strings']=pd.Series(['hi','lucas'], index=[1,2])
print(df)

   Integers  Floats strings
1         1     1.2      hi
2         2     3.4   lucas
3         3     5.6     NaN

In [45]:
cart.insert(1,'Sona',[200,40,100,0,600])
print(cart)

           Bob  Sona  Alice   Mary
bike     245.0   200  500.0  200.0
book       NaN    40   40.0   50.0
glasses    NaN   100  110.0    NaN
pants     25.0     0   45.0    NaN
watch     55.0   600    NaN  600.0

In [46]:
print(cart)

           Bob  Sona  Alice   Mary
bike     245.0   200  500.0  200.0
book       NaN    40   40.0   50.0
glasses    NaN   100  110.0    NaN
pants     25.0     0   45.0    NaN
watch     55.0   600    NaN  600.0

In [47]:
cart.pop('Sona')
print(cart)

           Bob  Alice   Mary
bike     245.0  500.0  200.0
book       NaN   40.0   50.0
glasses    NaN  110.0    NaN
pants     25.0   45.0    NaN
watch     55.0    NaN  600.0

In [48]:
cart_2=cart.drop(['book'],axis=0)
print(cart_2)

           Bob  Alice   Mary
bike     245.0  500.0  200.0
glasses    NaN  110.0    NaN
pants     25.0   45.0    NaN
watch     55.0    NaN  600.0

In [49]:
cart_2=cart_2.rename(columns={'Bob':'Ali','Alice':'Bobby','Mary':'Cherry'})
print(cart_2)

           Ali  Bobby  Cherry
bike     245.0  500.0   200.0
glasses    NaN  110.0     NaN
pants     25.0   45.0     NaN
watch     55.0    NaN   600.0

In [50]:
cart_2=cart_2.rename(index={'bike':'cycle'})
print(cart_2)

           Ali  Bobby  Cherry
cycle    245.0  500.0   200.0
glasses    NaN  110.0     NaN
pants     25.0   45.0     NaN
watch     55.0    NaN   600.0

In [51]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

In [52]:
print(store_items)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [53]:
store_items.isnull() #check for null values

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [54]:
store_items.isnull().sum() #sum null values

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [55]:
store_items.isnull().sum().sum() #total null values in store_items

3

In [56]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [57]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [58]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [59]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [60]:
store_items.fillna(method='ffill', axis=1)

C:\Users\prati\AppData\Local\Temp\ipykernel_31044\3815532448.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method='ffill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [61]:
store_items.fillna(method='backfill', axis=0)

C:\Users\prati\AppData\Local\Temp\ipykernel_31044\2913149665.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  store_items.fillna(method='backfill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [62]:
store_items.fillna(np.mean(store_items, axis=0))

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     27.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     8.5     10   26.0      4.0

In [63]:
google_stock= pd.read_csv('goog.csv')

In [128]:
print(type(google_stock))
google_stock.head(10)

<class 'pandas.core.frame.DataFrame'>

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400
5  2004-08-26  52.135906  53.626213  51.991844  53.606342  53.606342   7148200
6  2004-08-27  53.700729  53.959049  52.503513  52.732029  52.732029   6258300
7  2004-08-30  52.299839  52.404160  50.675404  50.675404  50.675404   5235700
8  2004-08-31  50.819469  51.519913  50.749920  50.854240  50.854240   4954800
9  2004-09-01  51.018177  51.152302  49.512966  49.801090  49.801090   9206800

In [130]:
google_stock.tail(10)

,Date,Open,High,Low,Close,Adj Close,Volume
3303,2017-10-02,959.979980,962.539978,947.840027,953.270020,953.270020,1283400
3304,2017-10-03,954.000000,958.000000,949.140015,957.789978,957.789978,888300
3305,2017-10-04,957.000000,960.390015,950.690002,951.679993,951.679993,952400
3306,2017-10-05,955.489990,970.909973,955.179993,969.960022,969.960022,1213800
3307,2017-10-06,966.700012,979.460022,963.359985,978.890015,978.890015,1173900
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [134]:
google_stock.isna().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [136]:
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [138]:
np.mean(google_stock['Volume'])

8038475.550860248

In [150]:
numeric_google_stock= google_stock.select_dtypes(include=['number'])
numeric_google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [162]:
fake_data= pd.read_csv('fake-company.csv')
fake_data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991   Dakota         HR   26   52000
4  1991     Elsa         RD   31   50000
5  1991    Frank      Admin   46   60000
6  1992    Grace      Admin   27   60000
7  1992  Hoffman         RD   32   52000
8  1992    Inaar      Admin   28   62000

In [186]:
fake_data.loc[:,['Year','Salary']]

   Year  Salary
0  1990   50000
1  1990   48000
2  1990   55000
3  1991   52000
4  1991   50000
5  1991   60000
6  1992   60000
7  1992   52000
8  1992   62000

In [216]:
fake_data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [218]:
fake_data.groupby(['Year','Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64

In [14]:
months = ['january', 'february', 'march', 'april', 'may', 'june']
months.index('february')+1

2

In [41]:
import time
import pandas as pd
import numpy as np

CITY_DATA = { 'chicago': 'chicago.csv',
              'new york city': 'new_york_city.csv',
              'washington': 'washington.csv' }

def get_filters():
    """
    Asks user to specify a city, month, and day to analyze.

    Returns:
        (str) city - name of the city to analyze
        (str) month - name of the month to filter by, or "all" to apply no month filter
        (str) day - name of the day of week to filter by, or "all" to apply no day filter
    """
    print('Hello! Let\'s explore some US bikeshare data!')
    # TO DO: get user input for city (chicago, new york city, washington). HINT: Use a while loop to handle invalid inputs
    while True:
         cities=[ 'chicago','new york city', 'washington']
         city=input('which city you would like to explore?: options:\n chicago OR \n new york city OR \n washigton').lower()
         print(f'Selected city is {city}')
         if city not in cities:
            print('invalid input, please try again')
         else:
            break